consumir_middleware_exemplos/benchmark_alimentadb/resultados_nao_usados/teste_10000_32threads/SQLStreamify.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Target transaction rate: 60/sec
Report intermediate results every 2 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 2s ] thds: 32 tps: 57.46 qps: 347.26 (r/w/o: 0.00/231.84/115.42) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 2s ] queue length: 0, concurrency: 1
[ 4s ] thds: 32 tps: 50.50 qps: 303.03 (r/w/o: 0.00/202.02/101.01) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 4s ] queue length: 0, concurrency: 1
[ 6s ] thds: 32 tps: 58.50 qps: 362.50 (r/w/o: 0.00/241.00/121.50) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 6s ] queue length: 0, concurrency: 10
[ 8s ] thds: 32 tps: 71.00 qps: 417.00 (r/w/o: 0.00/279.00/138.00) lat (ms,95%): 846.57 err/s: 0.00 reconn/s: 0.00
[ 8s ] queue length: 0, concurrency: 2
[ 10s ] thds: 32 tps: 49.00 qps: 288.99 (r/w/o: 0.00/191.99/97.00) lat (ms,95%): 467.30 err/s: 0.00 reconn/s: 0.00
[ 10s ] queue length: 0, concurrency: 0
[ 12s ] thds: 32 tps: 67.50 qps: 405.01 (r/w/o: 0.00/270.01/135.00) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 12s ] queue length: 0, concurrency: 0
[ 14s ] thds: 32 tps: 30.00 qps: 218.50 (r/w/o: 0.00/142.50/76.00) lat (ms,95%): 520.62 err/s: 0.00 reconn/s: 0.00
[ 14s ] queue length: 13, concurrency: 32
[ 16s ] thds: 32 tps: 90.00 qps: 510.00 (r/w/o: 0.00/344.00/166.00) lat (ms,95%): 759.88 err/s: 0.00 reconn/s: 0.00
[ 16s ] queue length: 0, concurrency: 4
[ 18s ] thds: 32 tps: 58.00 qps: 342.00 (r/w/o: 0.00/227.50/114.50) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 18s ] queue length: 0, concurrency: 1
[ 20s ] thds: 32 tps: 53.50 qps: 323.50 (r/w/o: 0.00/216.00/107.50) lat (ms,95%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 20s ] queue length: 0, concurrency: 2
[ 22s ] thds: 32 tps: 49.50 qps: 330.01 (r/w/o: 0.00/216.01/114.00) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 22s ] queue length: 1, concurrency: 32
[ 24s ] thds: 32 tps: 74.00 qps: 408.50 (r/w/o: 0.00/276.00/132.50) lat (ms,95%): 746.32 err/s: 0.00 reconn/s: 0.00
[ 24s ] queue length: 0, concurrency: 1
[ 26s ] thds: 32 tps: 70.00 qps: 424.98 (r/w/o: 0.00/283.99/140.99) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 26s ] queue length: 0, concurrency: 3
[ 28s ] thds: 32 tps: 65.50 qps: 400.51 (r/w/o: 0.00/268.01/132.50) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 28s ] queue length: 0, concurrency: 6
[ 30s ] thds: 32 tps: 57.00 qps: 327.00 (r/w/o: 0.00/216.00/111.00) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 30s ] queue length: 0, concurrency: 0
[ 32s ] thds: 32 tps: 60.00 qps: 378.49 (r/w/o: 0.00/250.00/128.50) lat (ms,95%): 337.94 err/s: 0.00 reconn/s: 0.00
[ 32s ] queue length: 0, concurrency: 17
[ 34s ] thds: 32 tps: 68.50 qps: 395.00 (r/w/o: 0.00/266.00/129.00) lat (ms,95%): 404.61 err/s: 0.00 reconn/s: 0.00
[ 34s ] queue length: 0, concurrency: 1
[ 36s ] thds: 32 tps: 57.00 qps: 347.01 (r/w/o: 0.00/232.00/115.00) lat (ms,95%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 36s ] queue length: 0, concurrency: 3
[ 38s ] thds: 32 tps: 56.00 qps: 338.50 (r/w/o: 0.00/226.00/112.50) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 38s ] queue length: 0, concurrency: 4
[ 40s ] thds: 32 tps: 63.00 qps: 368.01 (r/w/o: 0.00/244.01/124.00) lat (ms,95%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 40s ] queue length: 0, concurrency: 0
[ 42s ] thds: 32 tps: 44.99 qps: 282.47 (r/w/o: 0.00/189.98/92.49) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 42s ] queue length: 0, concurrency: 6
[ 44s ] thds: 32 tps: 64.00 qps: 374.02 (r/w/o: 0.00/248.01/126.01) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 44s ] queue length: 0, concurrency: 0
[ 46s ] thds: 32 tps: 39.50 qps: 260.51 (r/w/o: 0.00/170.00/90.50) lat (ms,95%): 530.08 err/s: 0.00 reconn/s: 0.00
[ 46s ] queue length: 0, concurrency: 24
[ 48s ] thds: 32 tps: 64.50 qps: 375.51 (r/w/o: 0.00/250.51/125.00) lat (ms,95%): 1129.24 err/s: 0.00 reconn/s: 0.00
[ 48s ] queue length: 0, concurrency: 16
[ 50s ] thds: 32 tps: 68.00 qps: 395.99 (r/w/o: 0.00/267.49/128.50) lat (ms,95%): 520.62 err/s: 0.00 reconn/s: 0.00
[ 50s ] queue length: 0, concurrency: 1
[ 52s ] thds: 32 tps: 61.00 qps: 373.51 (r/w/o: 0.00/250.01/123.50) lat (ms,95%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 52s ] queue length: 0, concurrency: 4
[ 54s ] thds: 32 tps: 67.00 qps: 397.01 (r/w/o: 0.00/264.01/133.00) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 54s ] queue length: 0, concurrency: 2
[ 56s ] thds: 32 tps: 58.49 qps: 351.47 (r/w/o: 0.00/233.98/117.49) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 56s ] queue length: 0, concurrency: 3
[ 58s ] thds: 32 tps: 52.50 qps: 314.50 (r/w/o: 0.00/210.00/104.50) lat (ms,95%): 802.05 err/s: 0.00 reconn/s: 0.00
[ 58s ] queue length: 0, concurrency: 3
[ 60s ] thds: 32 tps: 68.51 qps: 423.54 (r/w/o: 0.00/284.03/139.51) lat (ms,95%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 60s ] queue length: 0, concurrency: 7
[ 62s ] thds: 32 tps: 72.00 qps: 419.50 (r/w/o: 0.00/278.00/141.50) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 62s ] queue length: 0, concurrency: 2
[ 64s ] thds: 32 tps: 59.50 qps: 356.99 (r/w/o: 0.00/238.00/119.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 64s ] queue length: 0, concurrency: 2
[ 66s ] thds: 32 tps: 54.00 qps: 319.00 (r/w/o: 0.00/212.00/107.00) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 66s ] queue length: 0, concurrency: 0
[ 68s ] thds: 32 tps: 52.00 qps: 330.50 (r/w/o: 0.00/216.50/114.00) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 68s ] queue length: 0, concurrency: 20
[ 70s ] thds: 32 tps: 62.00 qps: 357.48 (r/w/o: 0.00/239.48/117.99) lat (ms,95%): 787.74 err/s: 0.00 reconn/s: 0.00
[ 70s ] queue length: 0, concurrency: 8
[ 72s ] thds: 32 tps: 70.01 qps: 418.53 (r/w/o: 0.00/282.02/136.51) lat (ms,95%): 458.96 err/s: 0.00 reconn/s: 0.00
[ 72s ] queue length: 0, concurrency: 1
[ 74s ] thds: 32 tps: 63.50 qps: 390.99 (r/w/o: 0.00/261.99/129.00) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 74s ] queue length: 0, concurrency: 3
[ 76s ] thds: 32 tps: 56.50 qps: 329.01 (r/w/o: 0.00/218.01/111.00) lat (ms,95%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 76s ] queue length: 0, concurrency: 1
[ 78s ] thds: 32 tps: 57.50 qps: 345.00 (r/w/o: 0.00/230.00/115.00) lat (ms,95%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 78s ] queue length: 0, concurrency: 1
[ 80s ] thds: 32 tps: 44.00 qps: 332.49 (r/w/o: 0.00/230.00/102.50) lat (ms,95%): 759.88 err/s: 0.00 reconn/s: 0.00
[ 80s ] queue length: 0, concurrency: 30
[ 82s ] thds: 32 tps: 66.00 qps: 327.51 (r/w/o: 0.00/210.00/117.50) lat (ms,95%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 82s ] queue length: 0, concurrency: 1
[ 84s ] thds: 32 tps: 56.99 qps: 344.45 (r/w/o: 0.00/229.96/114.48) lat (ms,95%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 84s ] queue length: 0, concurrency: 3
[ 86s ] thds: 32 tps: 66.01 qps: 391.07 (r/w/o: 0.00/260.04/131.02) lat (ms,95%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 86s ] queue length: 0, concurrency: 0
[ 88s ] thds: 32 tps: 58.00 qps: 355.50 (r/w/o: 0.00/236.00/119.50) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 88s ] queue length: 0, concurrency: 8
[ 90s ] thds: 32 tps: 56.00 qps: 336.49 (r/w/o: 0.00/225.00/111.50) lat (ms,95%): 926.33 err/s: 0.00 reconn/s: 0.00
[ 90s ] queue length: 0, concurrency: 6
[ 92s ] thds: 32 tps: 53.00 qps: 320.00 (r/w/o: 0.00/215.00/105.00) lat (ms,95%): 434.83 err/s: 0.00 reconn/s: 0.00
[ 92s ] queue length: 0, concurrency: 4
[ 94s ] thds: 32 tps: 59.50 qps: 347.00 (r/w/o: 0.00/230.00/117.00) lat (ms,95%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 94s ] queue length: 0, concurrency: 0
[ 96s ] thds: 32 tps: 57.50 qps: 352.49 (r/w/o: 0.00/236.00/116.50) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 96s ] queue length: 0, concurrency: 3
[ 98s ] thds: 32 tps: 52.00 qps: 309.51 (r/w/o: 0.00/206.01/103.50) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 98s ] queue length: 0, concurrency: 2
[ 100s ] thds: 32 tps: 66.99 qps: 399.47 (r/w/o: 0.00/265.98/133.49) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 100s ] queue length: 0, concurrency: 0
[ 102s ] thds: 32 tps: 57.00 qps: 357.03 (r/w/o: 0.00/240.02/117.01) lat (ms,95%): 110.66 err/s: 0.00 reconn/s: 0.00
[ 102s ] queue length: 0, concurrency: 7
[ 104s ] thds: 32 tps: 68.00 qps: 395.98 (r/w/o: 0.00/260.98/134.99) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 104s ] queue length: 0, concurrency: 5
[ 106s ] thds: 32 tps: 77.00 qps: 464.52 (r/w/o: 0.00/311.01/153.51) lat (ms,95%): 960.30 err/s: 0.00 reconn/s: 0.00
[ 106s ] queue length: 0, concurrency: 4
[ 108s ] thds: 32 tps: 66.00 qps: 388.00 (r/w/o: 0.00/258.00/130.00) lat (ms,95%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 108s ] queue length: 0, concurrency: 0
[ 110s ] thds: 32 tps: 58.50 qps: 358.50 (r/w/o: 0.00/240.00/118.50) lat (ms,95%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 110s ] queue length: 0, concurrency: 3
[ 112s ] thds: 32 tps: 59.00 qps: 354.00 (r/w/o: 0.00/236.00/118.00) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 112s ] queue length: 0, concurrency: 3
[ 114s ] thds: 32 tps: 67.50 qps: 402.51 (r/w/o: 0.00/268.00/134.50) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 114s ] queue length: 0, concurrency: 2
[ 116s ] thds: 32 tps: 49.50 qps: 296.99 (r/w/o: 0.00/198.00/99.00) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 116s ] queue length: 0, concurrency: 2
[ 118s ] thds: 32 tps: 59.00 qps: 356.50 (r/w/o: 0.00/238.00/118.50) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 118s ] queue length: 0, concurrency: 3
[ 120s ] thds: 32 tps: 67.50 qps: 400.00 (r/w/o: 0.00/266.00/134.00) lat (ms,95%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 120s ] queue length: 0, concurrency: 1
[ 122s ] thds: 32 tps: 62.49 qps: 379.97 (r/w/o: 0.00/253.98/125.99) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 122s ] queue length: 0, concurrency: 3
[ 124s ] thds: 32 tps: 59.00 qps: 351.49 (r/w/o: 0.00/233.99/117.50) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 124s ] queue length: 0, concurrency: 3
[ 126s ] thds: 32 tps: 60.01 qps: 360.04 (r/w/o: 0.00/240.03/120.01) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 126s ] queue length: 0, concurrency: 2
[ 128s ] thds: 32 tps: 68.50 qps: 408.50 (r/w/o: 0.00/272.00/136.50) lat (ms,95%): 1013.60 err/s: 0.00 reconn/s: 0.00
[ 128s ] queue length: 0, concurrency: 1
[ 130s ] thds: 32 tps: 64.00 qps: 389.00 (r/w/o: 0.00/260.00/129.00) lat (ms,95%): 530.08 err/s: 0.00 reconn/s: 0.00
[ 130s ] queue length: 0, concurrency: 3
[ 132s ] thds: 32 tps: 60.50 qps: 357.99 (r/w/o: 0.00/237.99/120.00) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 132s ] queue length: 0, concurrency: 1
[ 134s ] thds: 32 tps: 57.00 qps: 349.50 (r/w/o: 0.00/234.00/115.50) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 134s ] queue length: 0, concurrency: 4
[ 136s ] thds: 32 tps: 51.50 qps: 311.51 (r/w/o: 0.00/208.01/103.50) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 136s ] queue length: 0, concurrency: 5
[ 138s ] thds: 32 tps: 65.00 qps: 392.50 (r/w/o: 0.00/262.00/130.50) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 138s ] queue length: 0, concurrency: 6
[ 140s ] thds: 32 tps: 58.50 qps: 352.49 (r/w/o: 0.00/235.00/117.50) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 140s ] queue length: 0, concurrency: 7
[ 142s ] thds: 32 tps: 62.00 qps: 360.50 (r/w/o: 0.00/239.00/121.50) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 142s ] queue length: 0, concurrency: 2
[ 144s ] thds: 32 tps: 52.00 qps: 318.50 (r/w/o: 0.00/213.00/105.50) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 144s ] queue length: 0, concurrency: 5
[ 146s ] thds: 32 tps: 65.50 qps: 391.49 (r/w/o: 0.00/260.99/130.50) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 146s ] queue length: 0, concurrency: 5
[ 148s ] thds: 32 tps: 64.50 qps: 384.51 (r/w/o: 0.00/256.00/128.50) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 148s ] queue length: 0, concurrency: 4
[ 150s ] thds: 32 tps: 61.49 qps: 385.96 (r/w/o: 0.00/258.97/126.99) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
[ 150s ] queue length: 0, concurrency: 11
[ 152s ] thds: 32 tps: 61.51 qps: 344.54 (r/w/o: 0.00/227.03/117.51) lat (ms,95%): 539.71 err/s: 0.00 reconn/s: 0.00
[ 152s ] queue length: 0, concurrency: 0
[ 154s ] thds: 32 tps: 47.00 qps: 342.00 (r/w/o: 0.00/233.50/108.50) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 154s ] queue length: 0, concurrency: 29
[ 156s ] thds: 32 tps: 79.00 qps: 421.51 (r/w/o: 0.00/276.50/145.00) lat (ms,95%): 569.67 err/s: 0.00 reconn/s: 0.00
[ 156s ] queue length: 0, concurrency: 3
[ 158s ] thds: 32 tps: 63.50 qps: 375.99 (r/w/o: 0.00/250.00/126.00) lat (ms,95%): 61.08 err/s: 0.00 reconn/s: 0.00
[ 158s ] queue length: 0, concurrency: 1
[ 160s ] thds: 32 tps: 63.50 qps: 383.51 (r/w/o: 0.00/256.00/127.50) lat (ms,95%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 160s ] queue length: 0, concurrency: 2
[ 162s ] thds: 32 tps: 61.50 qps: 366.50 (r/w/o: 0.00/244.00/122.50) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 162s ] queue length: 0, concurrency: 1
[ 164s ] thds: 32 tps: 62.50 qps: 385.00 (r/w/o: 0.00/255.00/130.00) lat (ms,95%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 164s ] queue length: 0, concurrency: 11
[ 166s ] thds: 32 tps: 69.50 qps: 409.51 (r/w/o: 0.00/275.01/134.50) lat (ms,95%): 493.24 err/s: 0.00 reconn/s: 0.00
[ 166s ] queue length: 0, concurrency: 2
[ 168s ] thds: 32 tps: 58.99 qps: 372.95 (r/w/o: 0.00/250.47/122.48) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 168s ] queue length: 0, concurrency: 11
[ 170s ] thds: 32 tps: 72.51 qps: 411.03 (r/w/o: 0.00/271.52/139.51) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 170s ] queue length: 0, concurrency: 0
[ 172s ] thds: 32 tps: 55.00 qps: 337.01 (r/w/o: 0.00/225.51/111.50) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 172s ] queue length: 0, concurrency: 3
[ 174s ] thds: 32 tps: 54.49 qps: 351.94 (r/w/o: 0.00/235.96/115.98) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 174s ] queue length: 0, concurrency: 18
[ 176s ] thds: 32 tps: 67.51 qps: 378.07 (r/w/o: 0.00/250.54/127.52) lat (ms,95%): 493.24 err/s: 0.00 reconn/s: 0.00
[ 176s ] queue length: 0, concurrency: 2
[ 178s ] thds: 32 tps: 56.50 qps: 351.51 (r/w/o: 0.00/236.01/115.50) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 178s ] queue length: 0, concurrency: 7
[ 180s ] thds: 32 tps: 69.00 qps: 403.99 (r/w/o: 0.00/267.99/136.00) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 180s ] queue length: 0, concurrency: 3
[ 182s ] thds: 32 tps: 61.50 qps: 366.51 (r/w/o: 0.00/244.01/122.50) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 182s ] queue length: 0, concurrency: 2
[ 184s ] thds: 32 tps: 65.50 qps: 392.99 (r/w/o: 0.00/262.00/131.00) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 184s ] queue length: 0, concurrency: 2
[ 186s ] thds: 32 tps: 61.50 qps: 371.50 (r/w/o: 0.00/248.00/123.50) lat (ms,95%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 186s ] queue length: 0, concurrency: 3
[ 188s ] thds: 32 tps: 62.00 qps: 367.00 (r/w/o: 0.00/244.00/123.00) lat (ms,95%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 188s ] queue length: 0, concurrency: 1
[ 190s ] thds: 32 tps: 68.50 qps: 413.51 (r/w/o: 0.00/276.00/137.50) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 190s ] queue length: 0, concurrency: 2
[ 192s ] thds: 32 tps: 70.50 qps: 420.49 (r/w/o: 0.00/280.00/140.50) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 192s ] queue length: 0, concurrency: 1
[ 194s ] thds: 32 tps: 56.50 qps: 338.98 (r/w/o: 0.00/225.98/112.99) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 194s ] queue length: 0, concurrency: 1
[ 196s ] thds: 32 tps: 63.00 qps: 383.03 (r/w/o: 0.00/256.02/127.01) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 196s ] queue length: 0, concurrency: 3
[ 198s ] thds: 32 tps: 65.00 qps: 385.00 (r/w/o: 0.00/256.00/129.00) lat (ms,95%): 816.63 err/s: 0.00 reconn/s: 0.00
[ 198s ] queue length: 0, concurrency: 1
[ 200s ] thds: 32 tps: 57.50 qps: 345.00 (r/w/o: 0.00/230.00/115.00) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 200s ] queue length: 0, concurrency: 1
SQL statistics:
    queries performed:
        read:                            0
        write:                           48740
        other:                           24370
        total:                           73110
    transactions:                        12185  (60.92 per sec.)
    queries:                             73110  (365.51 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          200.0212s
    total number of events:              12185

Latency (ms):
         min:                                   21.99
         avg:                                  100.05
         max:                                 1305.39
         95th percentile:                      484.44
         sum:                              1219163.84

Threads fairness:
    events (avg/stddev):           380.7812/2.55
    execution time (avg/stddev):   38.0989/1.11